'''Напишите программу, которая считывает строку с числом nnn,
которое задаёт количество чисел, которые нужно считать.
Далее считывает nnn строк с числами xix_ixi​, по одному числу в каждой строке.
Итого будет n+1n+1n+1 строк.

При считывании числа xix_ixi​ программа должна
на отдельной строке вывести значение f(xi)f(x_i)f(xi​).
Функция f(x) уже реализована и доступна для вызова. 

Функция вычисляется достаточно долго и зависит только от
переданного аргумента x x x. Для того, чтобы уложиться в ограничение
по времени, нужно избежать повторного вычисления значений.'''
dc={}
n=int(input())


for i in range(n):
    x=int(input())
    if x in dc:
        print(dc[x])
    else:
        dc[x]=f(x)
        print(dc[x])
