'''Алгоритм

Программа будет очень простой: 

    Спросить пользователя, о чем он хочет сделать напоминание. 
    Спросить, когда (через какое время, в минутах) 
    Рассчитать время ожидания (минуты умножить на секунды) 
    Ожидать указанное время 
    Напомнить о том, что пользователь запросил на шаге 1 

Хотя алгоритм прост, реализация каждого шага может сделать это приложение очень полезным. Например, на шагах 1 и 2 можно общаться с пользователем через разные каналы: клавиатуру, голосовые приложения или приложения для обмена сообщениями. Также можно изменить сам алгоритм, например, сделать его защищенным от выключения: если ваш компьютер выключается во время шага 4, он должен знать, о чем он должен напомнить. Но пока давайте разберемся с основными настройками. '''

import time

text = str(input('What shall I remind you about?'))

local_time = float(input('In how many minutes?"'))
local_time = local_time * 60
time.sleep(local_time)
print(text)